var city = [
  {
    "name": "朝阳镇",
    "sub": [
	{"name": "荣家垴村"},
	{"name": "中曲村"},
	{"name": "闫家坪村"},
	{"name": "草沟村"},
	{"name": "向阳村"},
	{"name": "童子河村"},
	{"name": "大南河村"},
	{"name": "胜利村"},
	{"name": "东河村"},
	{"name": "高家坡村"},
	{"name": "金石庄村"},
	{"name": "泥河村"},
	{"name": "洞子咀村"},
	{"name": "孙家庄村"},
	{"name": "九龙村"}
    ]
  },
  
  {
    "name": "南燕竹镇",
    "sub": [
	{"name": "大北河村"},
	{"name": "新家庄村"},
	{"name": "颉家河村"},
	{"name": "孟家沟村"},
	{"name": "太安驿村"},
	{"name": "白家庄村"},
	{"name": "吴家崖村"},
	{"name": "韩庄村"},
	{"name": "赵庄村"},
	{"name": "李上头村"},
	{"name": "赵巷头村"},
	{"name": "于家庄村"},
	{"name": "后掌村"},
	{"name": "小王强村"},
	{"name": "宋杜沟村"},
	{"name": "清平村"},
	{"name": "大南沟村"},
	{"name": "蔡庄村"},
	{"name": "中庄村"},
	{"name": "北燕竹村"},
	{"name": "南燕竹村"}
    ]
  },
  
  {
    "name": "宗艾镇",
    "sub": [
	{"name": "神武村"},
	{"name": "沟西村"},
	{"name": "东光村"},
	{"name": "下洲村"},
	{"name": "蔚河村"},
	{"name": "荣生村"},
	{"name": "范村"},
	{"name": "宗艾村"}
    ]
  },
  
    {
    "name": "平头镇",
    "sub": [
	{"name": "南沟村"},
	{"name": "王金庄村"},
	{"name": "富韩村"},
	{"name": "南庄村"},
	{"name": "李家山村"},
	{"name": "郭家庄村"},
	{"name": "罕山村"},
	{"name": "胡家堙村"},
	{"name": "百僧庄村"},
	{"name": "北张芹村"},
	{"name": "潘沟村"},
	{"name": "南张芹村"},
	{"name": "寨上村"},
	{"name": "黑水村"},
	{"name": "山底村"},
	{"name": "石河村"},
	{"name": "神山庄村"},
	{"name": "沟北村"},
	{"name": "南安多村"},
	{"name": "龙栖村"},
	{"name": "平头村"}
    ]
  },
  
    {
    "name": "松塔镇",
    "sub": [
	{"name": "昌光村"},
	{"name": "黑土岩村"},
	{"name": "南阳坡村"},
	{"name": "河头村"},
	{"name": "黑坪村"},
	{"name": "合立窝村"},
	{"name": "金瑶足村"},
	{"name": "横岭村"},
	{"name": "十字堙村"},
	{"name": "新寺庄村"},
	{"name": "上龙泉村"},
	{"name": "顺华村"},
	{"name": "长安村"},
	{"name": "曲旺村"},
	{"name": "里庄村"},
	{"name": "里思村"},
	{"name": "郭村"},
	{"name": "松塔村"}
    ]
  },
  
    {
    "name": "西洛镇",
    "sub": [
	{"name": "南岭村"},
	{"name": "道坪村"},
	{"name": "南下厢村"},
	{"name": "张庄村"},
	{"name": "篡木村"},
	{"name": "云烟村"},
	{"name": "王村"},
	{"name": "南河村"},
	{"name": "城治村"},
	{"name": "白道村"},
	{"name": "王玉垴村"},
	{"name": "沟东村"},
	{"name": "韩村"},
	{"name": "段廷村"},
	{"name": "刘家庄村"},
	{"name": "南东村"},
	{"name": "北东村"},
	{"name": "西洛村"}
    ]
  },
  
  {
    "name": "尹灵芝镇",
    "sub": [
	{"name": "冀家村"},
	{"name": "贾家庄村"},
	{"name": "泉水洼村"},
	{"name": "郭王庄村"},
	{"name": "落摩寺村"},
	{"name": "尹灵芝村"},
	{"name": "界石村"},
	{"name": "太平村"},
	{"name": "后沟村"},
	{"name": "大垴村"},
	{"name": "库仓村"},
	{"name": "山南村"},
	{"name": "晓庄村"},
	{"name": "张靖村"},
	{"name": "阳坡村"},
	{"name": "芹泉村"}
    ]
  },
  
    
  {
    "name": "平舒乡",
    "sub": [
	{"name": "龙门河村"},
	{"name": "上峪村"},
	{"name": "段王村"},
	{"name": "安公村"},
	{"name": "西郭义村"},
	{"name": "东郭义村"},
	{"name": "黄岭村"},
	{"name": "东岢村"},
	{"name": "西岢村"},
	{"name": "古城村"},
	{"name": "太安村"},
	{"name": "平舒村"}
    ]
  },
  
    {
    "name": "解愁乡",
    "sub": [
	{"name": "东村"},
	{"name": "赛头村"},
	{"name": "方山村"},
	{"name": "长榆河村"},
	{"name": "种子坡村"},
	{"name": "陈家河村"},
	{"name": "独璧村"},
	{"name": "冯家庄村"},
	{"name": "安胜村"},
	{"name": "下解愁村"},
	{"name": "解愁村"}
    ]
  },
  
    
    {
    "name": "温家庄乡",
    "sub": [
	{"name": "杨林头村"},
	{"name": "大兴庄村"},
	{"name": "山底铺村"},
	{"name": "程子旺村"},
	{"name": "郑家庄村"},
	{"name": "胜旺村"},
	{"name": "康家庄村"},
	{"name": "崔家垴村"},
	{"name": "温家庄村"},
	{"name": "富家沟村"},
	{"name": "大东庄村"},
	{"name": "小东庄村"}

    ]
  },
  
    {
    "name": "景尚乡",
    "sub": [
	{"name": "沿村"},
	{"name": "张韩河村"},
	{"name": "天恩村"},
	{"name": "张韩村"},
	{"name": "寺塘村"},
	{"name": "鸦鸣村"},
	{"name": "禹家寨村"},
	{"name": "重桃村"},
	{"name": "库韩村"},
	{"name": "贾豹村"},
	{"name": "景尚村"}
    ]
  },
  
   {
    "name": "上湖乡",
    "sub": [
	{"name": "常村"},
	{"name": "莲花池村"},
	{"name": "李坡村"},
	{"name": "北河村"},
	{"name": "史大合村"},
	{"name": "芦家庄村"},
	{"name": "段庄村"},
	{"name": "上湖村"}

    ]
  },
  
  
    
   {
    "name": "羊头崖乡",
    "sub": [
	{"name": "七里洼村"},
	{"name": "吉村"},
	{"name": "下白草坪村"},
	{"name": "南王昌村"},
	{"name": "昌村"},
	{"name": "东刘义村"},
	{"name": "独堆村"},
	{"name": "西草庄村"},
	{"name": "红洼村"},
	{"name": "阔郊村"},
	{"name": "堡底村"},
	{"name": "白云村"},
	{"name": "新南洼村"},
	{"name": "南坪村"},
	{"name": "豹庄村"},
	{"name": "山郊村"},
	{"name": "下庄村"},
	{"name": "盐土洼村"},
	{"name": "韩赠村"},
	{"name": "南寺庄村"},
	{"name": "羊头崖村"}
    ]
  },
  
     {
    "name": "马首乡",
    "sub": [
	{"name": "河底村"},
	{"name": "石泉村"},
	{"name": "碧石村"},
	{"name": "钮家庄村"},
	{"name": "三岔村"},
	{"name": "马首村"},
	{"name": "富村"},
	{"name": "吴逯垴村"},
	{"name": "北郭村"},
	{"name": "大照村"}
    ]
  },
  
     {
    "name": "丹凤城区管委会",
    "sub": [
	{"name": "元立村"},
	{"name": "大西庄村"},
	{"name": "张村"},
	{"name": "七里河村"},
	{"name": "西关社区"},
	{"name": "南港社区"},
	{"name": "城北社区"},
	{"name": "新阳社区"},
	{"name": "城西社区"},
	{"name": "城中社区"},
	{"name": "东安社区"},
	{"name": "火车站社区"}
    ]
  }
  
]
